In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'salary': [2500, 2500, 2500, 2500, 3000, 3500, 3500, 4000, 3000, 3000, 2500, 2500],
        'capacity': [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]}
months = ['jan', 'feb', 'mar', 'apr', 'may', 'jun', 'jul', 'aug', 'sen', 'oct', 'nov', 'dec']

In [3]:
df = pd.DataFrame(data, index=months)

In [4]:
df['amount'] = df['salary'] * df['capacity']

In [5]:
df

     salary  capacity  amount
jan    2500        31   77500
feb    2500        28   70000
mar    2500        31   77500
apr    2500        30   75000
may    3000        31   93000
jun    3500        30  105000
jul    3500        31  108500
aug    4000        31  124000
sen    3000        30   90000
oct    3000        31   93000
nov    2500        30   75000
dec    2500        31   77500

In [11]:
print('сумма: ', df.amount.sum(), 'RUB')

сумма:  1066000 RUB

In [12]:
print('в среднем за смену: ', round(df.salary.mean(), 2), 'RUB')

в среднем за смену:  2916.67 RUB